# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

my_list = [-10,1,2,-5,10,9]

print("Сумма всех элементов списка равна:",sum(my_list,start=0))
